import parl
from parl import layers
import numpy as np


class Model(parl.Model):
    def __init__(self, act_dim):
        ######################################################################
        ######################################################################
        #
        # 2. 请参考课堂Demo，配置model
        hid1_size = 128
        hid2_size = 128
        # 3层全连接网络
        self.fc1 = layers.fc(size=hid1_size,act='relu')
        self.fc2 = layers.fc(size=hid2_size,act='relu')
        self.fc3 = layers.fc(size=act_dim,act=None)

        ######################################################################
        ######################################################################

    def value(self, obs):
        # 定义网络
        # 输入state，输出所有action对应的Q，[Q(s,a1), Q(s,a2), Q(s,a3)...]
    
        ######################################################################
        ######################################################################
        #
        # 3. 请参考课堂Demo，组装Q网络
        h1 = self.fc1(input=obs)
        h2 = self.fc2(input=h1)
        Q = self.fc3(input=h2)
        #神经网络代替q表输出q值
        ######################################################################
        ######################################################################
        return Q
